
## Plan Result (stg)

[CI link](https://github.com/Tomo-zou-2525/tokidokiyaru-infra/actions/runs/5784906778)


<pre><code>Plan: 43 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.acm.aws_acm_certificate.default
  * module.acm.aws_acm_certificate_validation.default
  * module.acm.aws_route53_record.default[&#34;tokidoki.elevate-passion.cloud&#34;]
  * module.ecs.aws_cloudwatch_log_group.default
  * module.ecs.aws_ecr_repository.default
  * module.ecs.aws_ecs_cluster.default
  * module.ecs.aws_ecs_service.default
  * module.ecs.aws_ecs_task_definition.default
  * module.ecs.aws_iam_role.task_execution_role
  * module.ecs.aws_iam_role_policy_attachment.task_execution_role_policy
  * module.ecs.aws_lb_listener_rule.default
  * module.ecs.aws_lb_target_group.default
  * module.ecs.aws_security_group.default
  * module.ecs.aws_security_group_rule.egress
  * module.ecs.aws_security_group_rule.ingress_http
  * module.elb.aws_lb.default
  * module.elb.aws_lb_listener.http
  * module.elb.aws_lb_listener.https
  * module.elb.aws_route53_record.default
  * module.elb.aws_security_group.default
  * module.elb.aws_security_group_rule.egress
  * module.elb.aws_security_group_rule.ingress_http
  * module.elb.aws_security_group_rule.ingress_https
  * module.network.aws_internet_gateway.default
  * module.network.aws_route.public
  * module.network.aws_route_table.private
  * module.network.aws_route_table.public
  * module.network.aws_route_table_association.privates[&#34;0&#34;]
  * module.network.aws_route_table_association.privates[&#34;1&#34;]
  * module.network.aws_route_table_association.public[&#34;0&#34;]
  * module.network.aws_route_table_association.public[&#34;1&#34;]
  * module.network.aws_security_group.vpc_endpoint
  * module.network.aws_security_group_rule.egress
  * module.network.aws_security_group_rule.ingress
  * module.network.aws_subnet.privates[&#34;0&#34;]
  * module.network.aws_subnet.privates[&#34;1&#34;]
  * module.network.aws_subnet.publics[&#34;0&#34;]
  * module.network.aws_subnet.publics[&#34;1&#34;]
  * module.network.aws_vpc.default
  * module.network.aws_vpc_endpoint.ecr_api
  * module.network.aws_vpc_endpoint.ecr_dkr
  * module.network.aws_vpc_endpoint.logs
  * module.network.aws_vpc_endpoint.s3


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.acm.aws_acm_certificate.default will be created
  + resource "aws_acm_certificate" "default" {
      + arn                       = (known after apply)
      + domain_name               = "tokidoki.elevate-passion.cloud"
      + domain_validation_options = [
          + {
              + domain_name           = "tokidoki.elevate-passion.cloud"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "tokidoki.elevate-passion.cloud",
        ]
      + tags_all                  = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.acm.aws_acm_certificate_validation.default will be created
  + resource "aws_acm_certificate_validation" "default" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm.aws_route53_record.default["tokidoki.elevate-passion.cloud"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0305741XFU9USN50WEK"
    }

  # module.ecs.data.aws_ecs_task_definition.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "default" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "stg-tokidokiyaru"
      + task_role_arn        = (known after apply)
    }

  # module.ecs.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/stg/tokidokiyaru/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
    }

  # module.ecs.aws_ecr_repository.default will be created
  + resource "aws_ecr_repository" "default" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "stg-tokidokiyaru"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_ecs_cluster.default will be created
  + resource "aws_ecs_cluster" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "stg-tokidokiyaru"
      + tags_all = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_service.default will be created
  + resource "aws_ecs_service" "default" {
      + cluster                            = "stg-tokidokiyaru"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "stg-tokidokiyaru"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "app"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.default will be created
  + resource "aws_ecs_task_definition" "default" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "stg-tokidokiyaru"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "stg-tokidokiyaru-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "stg-tokidokiyaru-ecs-task-execution-role"
    }

  # module.ecs.aws_lb_listener_rule.default will be created
  + resource "aws_lb_listener_rule" "default" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # module.ecs.aws_lb_target_group.default will be created
  + resource "aws_lb_target_group" "default" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "stg-tokidokiyaru"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.ecs.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "stg tokidokiyaru ecs security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "stg-tokidokiyaru-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "stg-tokidokiyaru-ecs"
        }
      + tags_all               = {
          + "Name"      = "stg-tokidokiyaru-ecs"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all to anywhere"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs.aws_security_group_rule.ingress_http will be created
  + resource "aws_security_group_rule" "ingress_http" {
      + description              = "Allow HTTP from ELB"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.elb.aws_lb.default will be created
  + resource "aws_lb" "default" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = true
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "stg-tokidokiyaru"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags_all                                    = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.elb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.elb.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "ok"
              + status_code  = "200"
            }
        }
    }

  # module.elb.aws_route53_record.default will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "tokidoki.elevate-passion.cloud"
      + type            = "A"
      + zone_id         = "Z0305741XFU9USN50WEK"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.elb.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "stg tokidokiyaru alb security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "stg-tokidokiyaru-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "stg-tokidokiyaru-alb"
        }
      + tags_all               = {
          + "Name"      = "stg-tokidokiyaru-alb"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                 = (known after apply)
    }

  # module.elb.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all to anywhere"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.elb.aws_security_group_rule.ingress_http will be created
  + resource "aws_security_group_rule" "ingress_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTP from anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.elb.aws_security_group_rule.ingress_https will be created
  + resource "aws_security_group_rule" "ingress_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTPS from anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.network.aws_internet_gateway.default will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "stg-tokidokiyaru"
        }
      + tags_all = {
          + "Name"      = "stg-tokidokiyaru"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "stg-tokidokiyaru-private"
        }
      + tags_all         = {
          + "Name"      = "stg-tokidokiyaru-private"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "stg-tokidokiyaru-public"
        }
      + tags_all         = {
          + "Name"      = "stg-tokidokiyaru-public"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.privates["0"] will be created
  + resource "aws_route_table_association" "privates" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.privates["1"] will be created
  + resource "aws_route_table_association" "privates" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public["0"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public["1"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.vpc_endpoint will be created
  + resource "aws_security_group" "vpc_endpoint" {
      + arn                    = (known after apply)
      + description            = "stg tokidokiyaru VPC endpoint security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "stg-tokidokiyaru-vpc-endpoint"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "stg-tokidokiyaru-vpc-endpoint"
        }
      + tags_all               = {
          + "Name"      = "stg-tokidokiyaru-vpc-endpoint"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow HTTPS in VPC"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.network.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow HTTPS in VPC"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.network.aws_subnet.privates["0"] will be created
  + resource "aws_subnet" "privates" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "stg-tokidokiyaru-private-0"
        }
      + tags_all                                       = {
          + "Name"      = "stg-tokidokiyaru-private-0"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.privates["1"] will be created
  + resource "aws_subnet" "privates" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "stg-tokidokiyaru-private-1"
        }
      + tags_all                                       = {
          + "Name"      = "stg-tokidokiyaru-private-1"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.publics["0"] will be created
  + resource "aws_subnet" "publics" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "stg-tokidokiyaru-public-0"
        }
      + tags_all                                       = {
          + "Name"      = "stg-tokidokiyaru-public-0"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.publics["1"] will be created
  + resource "aws_subnet" "publics" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "stg-tokidokiyaru-public-1"
        }
      + tags_all                                       = {
          + "Name"      = "stg-tokidokiyaru-public-1"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "stg-tokidokiyaru"
        }
      + tags_all                             = {
          + "Name"      = "stg-tokidokiyaru"
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
    }

  # module.network.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = {
          + "Terraform" = "true"
          + "env"       = "prod"
          + "service"   = "tokidokiyaru"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

Plan: 43 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"ci","PRNumber":4,"Program":"tfcmt","SHA1":"677efcbaecbdaf501628f82e648df2d07ed6c36a","Target":"stg","Vars":{},"WorkflowName":"Terraform CI"} -->